RMSHE-MSH/GasSensorOS/lib/kernel/io_esp32_s3.cpp
/**
 * @file io_esp32_s3.cpp
 * @date 10.08.2024
 * @author RMSHE
 *
 * < GasSensorOS >
 * Copyright(C) 2024 RMSHE. All rights reserved.
 *
 * This program is free software : you can redistribute it and /or modify
 * it under the terms of the GNU Affero General Public License as
 * published by the Free Software Foundation, either version 3 of the
 * License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.See the
 * GNU Affero General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.If not, see < https://www.gnu.org/licenses/>.
 *
 * Electronic Mail : asdfghjkl851@outlook.com
 */

#include <driver/adc.h>
#include <esp32_s3_pin_defi.h>
#include <esp_adc_cal.h>
#include <io_esp32_s3.h>

#include <serial_warning.hpp>

// ESP32-S3-WROOM-1引脚功能定义
const std::unordered_map<uint8_t, std::unordered_set<uint8_t>> esp32_s3_wroom_1_gpios = {
    {0, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {1, {ADC1, TOUCH1, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {2, {ADC1, TOUCH2, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {3, {ADC1, TOUCH3, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {4, {ADC1, TOUCH4, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {5, {ADC1, TOUCH5, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {6, {ADC1, TOUCH6, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {7, {ADC1, TOUCH7, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {8, {ADC1, TOUCH8, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {9, {ADC1, TOUCH9, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {10, {ADC1, TOUCH10, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {11, {ADC2, TOUCH11, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {12, {ADC2, TOUCH12, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {13, {ADC2, TOUCH13, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {14, {ADC2, TOUCH14, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {15, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {16, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {17, {ADC2, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {18, {ADC2, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {19, {ADC2, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {20, {ADC2, UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {21, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {35, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI0, SPI1, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {36, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI0, SPI1, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {37, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI0, SPI1, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {38, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {39, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {40, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {41, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {42, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {43, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {44, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {45, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {46, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {47, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
    {48, {UART, I2C, PWM, I2S, LCD_CAMERA, RMT, SPI2, SPI3, PCNT_SIG, SDHOST, TWAI}},
};

// 定义了 ESP32-WROOM-32E GPIO管脚与ADC2通道的对应关系.
const std::unordered_map<uint8_t, adc2_channel_t> gpio_to_adc2_channel = {
    {4, ADC2_CHANNEL_0},  {0, ADC2_CHANNEL_1},  {2, ADC2_CHANNEL_2},  {15, ADC2_CHANNEL_3}, {13, ADC2_CHANNEL_4},
    {12, ADC2_CHANNEL_5}, {14, ADC2_CHANNEL_6}, {27, ADC2_CHANNEL_7}, {25, ADC2_CHANNEL_8}, {26, ADC2_CHANNEL_9}};

// 定义了 ESP32-WROOM-32E GPIO管脚与ADC1通道的对应关系.
const std::unordered_map<uint8_t, adc1_channel_t> gpio_to_adc1_channel = {
    {36, ADC1_CHANNEL_0}, {37, ADC1_CHANNEL_1}, {38, ADC1_CHANNEL_2}, {39, ADC1_CHANNEL_3},
    {32, ADC1_CHANNEL_4}, {33, ADC1_CHANNEL_5}, {34, ADC1_CHANNEL_6}, {35, ADC1_CHANNEL_7},
};

/**
 * @brief 获取模拟引脚读取的模拟数值
 * @return 模拟数值[0, 4095]
 */
int32_t ADC::gpioReadRawValue() { return raw_value; };

/**
 * @brief 获取模拟引脚读取的电压
 * @return 电压[0, 3300]mv
 */
uint32_t ADC::gpioReadVoltage() { return voltage; };

/**
 * @brief 设置模拟输出类型(可输出 模拟数值[0, 4095] 或 电压[0, 3300]mv)
 * @param mode: ADC_OUT_RAW_VALUE(模拟数值/默认) | ADC_OUT_VOLTAGE(电压)
 * @return 无
 */
void ADC::setAnalogOutputMode(bool mode) { OUTPUT_MODE = mode; }

/**
 * @brief 读取模拟数值和电压
 * @param pin: 拥有 ADC1 和 ADC2 单元的GPIO引脚
 * @return void
 */
void ADC::gpioReadAnalogBit(uint8_t pin) {
    raw_value = 4095;  // ADC 数值(0-4095)
    voltage = 3300;    // ADC 电压(0-3300mv)

    // 根据读出的电压值选择合适的衰减系数, 目的是增加ADC的准确度；
    auto adc_auto_atten = [](uint32_t _voltage) -> adc_atten_t {
        if (_voltage <= 1000)
            return ADC_ATTEN_DB_0;  // 电压为1V时最准确;
        else if (_voltage <= 1340)
            return ADC_ATTEN_DB_2_5;  // 电压为1.34V时最准确;
        else if (_voltage <= 2000)
            return ADC_ATTEN_DB_6;  // 电压为2V时最准确;
        else
            return ADC_ATTEN_DB_11;  // 电压为3.3V时最准确;
    };

