RMSHE-MSH/GasSensorOS/lib/kernel/io_esp32_s3.cpp
    // 创建一个ADC校准参数对象
    static esp_adc_cal_characteristics_t *adc_chars = (esp_adc_cal_characteristics_t *)calloc(1, sizeof(esp_adc_cal_characteristics_t));

    // 判断用户使用的GPIO管脚属于哪一个ADC单元(ESP32两个ADC单元：ADC_UNIT_1(SAR ADC1)和ADC_UNIT_2(SAR ADC2))
    if ((esp32_s3_wroom_1_gpios.find(pin)->second).find(ADC2) != (esp32_s3_wroom_1_gpios.find(pin)->second).end()) {
        /*若用户使用的引脚属于ADC2单元*/

        // 通过GPIO编号来查找对应的ADC2通道;
        adc2_channel_t channel = gpio_to_adc2_channel.find(pin)->second;

        // 要实现最准确的电压读取, 这里必须循环两次, 第一次读取粗略值后使用其校准衰减系数, 第二次再使用校准后的衰减系数读取精确电压;
        for (uint8_t i = 0; i < 2; ++i) {
            // 调用 adc_auto_atten 函数来自动校准衰减系数(选择使读出电压最准确的衰减系数)
            adc_atten_t atten = adc_auto_atten(voltage);

            // ADC2初始化(ADC2通道, 衰减系数)
            adc2_config_channel_atten(channel, atten);

            // ADC2 校准(ESP32两个ADC单元：ADC_UNIT_1(SAR ADC1)和ADC_UNIT_2(SAR ADC2), 衰减系数, ADC分辨率(测量位宽), 参考电压mv, ADC校准参数对象)
            esp_adc_cal_characterize(ADC_UNIT_2, atten, ADC_WIDTH_BIT_12, 3300, adc_chars);

            // ADC2 读取原始数值
            adc2_get_raw(channel, ADC_WIDTH_BIT_12, &raw_value);

            // 计算 ADC2 读取的电压值
            voltage = esp_adc_cal_raw_to_voltage(raw_value, adc_chars);
        }
    } else if ((esp32_s3_wroom_1_gpios.find(pin)->second).find(ADC1) != (esp32_s3_wroom_1_gpios.find(pin)->second).end()) {
        /*若用户使用的引脚属于 ADC1 单元*/

        // 通过 GPIO 编号来查找对应的 ADC1 通道;
        adc1_channel_t channel = gpio_to_adc1_channel.find(pin)->second;

        // 要实现最准确的电压读取, 这里必须循环两次, 第一次读取粗略值后使用其校准衰减系数, 第二次再使用校准后的衰减系数读取精确电压;
        for (uint8_t i = 0; i < 2; ++i) {
            // 调用 adc_auto_atten 函数来自动校准衰减系数(选择使读出电压最准确的衰减系数)
            adc_atten_t atten = adc_auto_atten(voltage);

            // 配置 ADC1 分辨率(测量位宽)
            adc1_config_width(ADC_WIDTH_BIT_12);

            // 配置 ADC1 的通道和衰减系数
            adc1_config_channel_atten(channel, atten);

            // ADC2 校准(ESP32两个ADC单元：ADC_UNIT_1(SAR ADC1)和ADC_UNIT_2(SAR ADC2), 衰减系数, ADC分辨率(测量位宽), 参考电压mv, ADC校准参数对象)
            esp_adc_cal_characterize(ADC_UNIT_1, atten, ADC_WIDTH_BIT_12, 3300, adc_chars);

            // ADC1 读取原始数值
            raw_value = adc1_get_raw(channel);

            // 计算 ADC1 读取的电压值
            voltage = esp_adc_cal_raw_to_voltage(raw_value, adc_chars);
        }
    }
}

/*------------------------------------ GPIO ------------------------------------*/

/**
 * @brief 初始化指定引脚的 GPIO 配置。
 *
 * 该函数用于初始化 ESP32-S3-WROOM-1 模块上的 GPIO 引脚配置。
 * 通过组合三态状态 (tri_state)、模式 (mode) 和输入输出类型 (io_type) 的任意标识符，可以实现GPIO 的灵活配置。
 *
 * @param[in] pin 要配置的 GPIO 引脚编号。
 * @param[in] configs 包含 GPIO 配置参数的向量。该向量中的标识符可以以任意顺序和数量出现，可以包括三态状态、模式和输入输出类型的标识符。
 *
 * @note 三态标识 (tri_state): GPIO_PU (上拉) | GPIO_PD (下拉) | GPIO_FLOAT (浮空)
 * @note 模式标识 (mode): GPIO_PP (推挽) | GPIO_OD (开漏) | GPIO_ANALOG (模拟) | GPIO_INTR (中断)
 * @note 输入输出类型标识 (io_type): GPIO_OUT (输出) | GPIO_IN (输入) | GPIO_IN_OUT (输入和输出)
 *
 * @note 只有在引脚合法且配置参数成功解析的情况下，函数才会设置引脚的配置。如果用户将模式设置为模拟输入，
 * 函数会验证该引脚是否支持 ADC。如果不支持，将发出警告并停止配置。
 *
 * @warning 如果传入的引脚编号不存在于 `esp32_s3_wroom_1_gpios` 列表中，函数将发出错误警告并直接返回。
 * @warning 如果引脚不支持用户设置的配置（例如 ADC 模式），函数将发出错误警告且不会应用该配置。
 *
 * @retval void 无返回值。
 *
 * @see parse_GPIO_config
 * @see set_GPIO_config
 */
void GPIOs::gpioInit(uint8_t pin, const std::unordered_set<uint8_t> &configs) {
    // 查询"pin"是否是合法的GPIO, 如果"pin"是实际上不存在的引脚则直接返回;
    auto gpio = esp32_s3_wroom_1_gpios.find(pin);
    if (gpio == esp32_s3_wroom_1_gpios.end()) {
        WARN(WarningLevel::ERROR, "this pin does not exist, pin:%d", pin);
        return;
    }

    // 解析并验证GPIO配置参数
    uint8_t tri_state, mode, io_type;
    if (!parse_GPIO_config(configs, tri_state, mode, io_type)) return;
    if (!validate_GPIO_config(tri_state, mode, io_type)) return;

    if (mode == GPIO_ANALOG) {
        // 用户设置引脚模式为模拟输入则查询该引脚是否支持模拟输入, 若支持则设置引脚模式;
        if (gpio->second.find(ADC2) != gpio->second.end() || gpio->second.find(ADC1) != gpio->second.end()) {
            set_GPIO_config(pin, tri_state, mode, io_type);
            return;
        }
        WARN(WarningLevel::ERROR, "this pin does not support ADC, pin:%d", pin);
    }

    set_GPIO_config(pin, tri_state, mode, io_type);
}

/**
 * @brief 替换指定引脚的 GPIO 配置
 *
 * 此函数用于根据提供的配置集合更新指定引脚的 GPIO 配置。它确保在应用新配置之前，
 * 该引脚已经初始化，并且配置参数合法有效。该函数允许灵活地更新引脚配置中的
 * 三态（tri_state）、模式（mode）和输入输出类型（io_type）。
 *
 * 代码功能概述：
 * - 引脚查找：首先在 GPIO 注册表中查找指定引脚，如果未初始化，则发出错误警告并返回。
 * - 配置解析：解析传入的配置集合，提取并解析三态、模式和输入输出类型参数。
 * - 默认配置处理：如果某一配置参数未设置（为 GPIO_NULL），则保留该引脚的当前配置。
 * - 配置验证：验证新的 GPIO 配置是否有效，如果无效，则发出警告并返回。
 * - 应用配置：将有效的新配置应用于指定引脚。
 *
 * @param pin 要配置的 GPIO 引脚编号
 * @param configs 包含新配置的集合，可能包含三态（tri_state）、模式（mode）和输入输出类型（io_type）
 *
 * @note 与 gpioInit 不同，本函数允许仅更新三联配置中的一个或多个参数，而不是全覆盖更新。
 */
void GPIOs::gpioReplaceConfig(uint8_t pin, const std::unordered_set<uint8_t> &configs) {
    // 在GPIO注册表中查找指定的pin
    auto it = GPIO_Registry.find(pin);
    // 未找到引脚(说明该引脚没有初始化), 则返回
    if (it == GPIO_Registry.end()) {
        WARN(WarningLevel::ERROR, "this pin is not initialized, pin:%d", pin);
        return;
    }

    // 解析GPIO配置参数
    uint8_t tri_state, mode, io_type;
    if (!parse_GPIO_config(configs, tri_state, mode, io_type)) return;

    // 如果某个配置参数为 GPIO_NULL，保留旧配置
    tri_state = (tri_state != GPIO_NULL) ? tri_state : it->second.tri_state;
    mode = (mode != GPIO_NULL) ? mode : it->second.mode;
    io_type = (io_type != GPIO_NULL) ? io_type : it->second.io_type;

    // 验证GPIO配置参数
    if (!validate_GPIO_config(tri_state, mode, io_type)) return;

    set_GPIO_config(pin, tri_state, mode, io_type);
}

/**
 * @brief 初始化一组 GPIO 引脚的配置。
 *
 * 该函数用于批量初始化一组 GPIO 引脚的配置。它通过遍历提供的引脚集合，对每个引脚调用 `gpioInit` 函数，并传入相同的配置参数进行配置。
 *
 * @param[in,out] pins 包含待初始化的 GPIO 引脚编号的 `std::unordered_set` 容器。集合中的每个引脚都将按给定的同一配置进行初始化。
 * @param[in] configs 包含 GPIO 配置参数的向量。该向量中的标识符可以以任意顺序和数量出现，可以包括三态状态、模式和输入输出类型的标识符。
 *
 * @note 三态标识 (tri_state): GPIO_PU (上拉) | GPIO_PD (下拉) | GPIO_FLOAT (浮空)
 * @note 模式标识 (mode): GPIO_PP (推挽) | GPIO_OD (开漏) | GPIO_ANALOG (模拟) | GPIO_INTR (中断)
 * @note 输入输出类型标识 (io_type): GPIO_OUT (输出) | GPIO_IN (输入) | GPIO_IN_OUT (输入和输出)
 *
 * @note 配置参数 `configs` 将应用于集合 `pins` 中的所有引脚。
 * @note 每个引脚的具体配置细节请参见 `gpioInit` 函数的说明。
 *
 * @warning 如果 `pins` 集合中包含不存在的引脚编号，`gpioInit` 函数将在初始化过程中发出警告，并跳过该引脚的配置。
 *
 * @retval void 无返回值。
 *
 * @see gpioInit
 */
void GPIOs::gpioInitGroup(const std::unordered_set<uint8_t> &pins, const std::unordered_set<uint8_t> &configs) {
    for (auto &i : pins) gpioInit(i, configs);
}

/**
 * @brief 读取一个GPIO引脚的电平值或模拟值
 * @param[in] pin GPIO引脚编号
 * @return 返回读取到的电平值（数字：HIGH/LOW）或模拟值（模拟数值[0, 4095]），如果GPIO引脚不存在，返回-1
 * @note 如果GPIO引脚未初始化，将自动初始化为浮空输入模式(GPIO_IN, GPIO_FLOAT)
 * @note 调用 setAnalogOutputMode(bool mode) 函数可以设置返回的模拟量类型，
 * mode 设为 ADC_OUT_RAW_VALUE(默认) 时返回模拟值[0, 4095]，设为 ADC_OUT_VOLTAGE 时返回电压值[0, 3300]mV
 */
int32_t GPIOs::gpioReadDataBit(uint8_t pin) {
    // 在GPIO注册表中查找指定的pin
    auto it = GPIO_Registry.find(pin);

