RMSHE-MSH/GasSensorOS/lib/kernel/io_esp32_s3.cpp
    // 如果未找到引脚，尝试自动初始化为浮空输入模式
    if (it == GPIO_Registry.end()) {
        gpioInit(pin, {GPIO_IN, GPIO_FLOAT});

        it = GPIO_Registry.find(pin);              // 初始化后重新查找引脚
        if (it == GPIO_Registry.end()) return -1;  // 如果初始化后仍未找到，返回-1
    }

    int32_t DataBit = -1;  // 初始化返回值，默认为-1

    // 检查引脚模式
    if (it->second.mode == GPIO_ANALOG) {
        // 如果引脚为模拟输入模式，读取模拟值或电压
        gpioReadAnalogBit(pin);

        // 如果模拟输出 mode 设为 ADC_OUT_RAW_VALUE(默认) 时返回模拟值[0, 4095], 设为 ADC_OUT_VOLTAGE时返回电压[0, 3300]mv;
        DataBit = (OUTPUT_MODE == ADC_OUT_RAW_VALUE) ? gpioReadRawValue() : gpioReadVoltage();
    } else {
        // 数字输入/输出模式
        if (it->second.io_type == GPIO_OUT || it->second.io_type == GPIO_IN_OUT) {
            // 如果为输出或双向模式，返回缓存的状态值
            DataBit = it->second.status;
        } else if (it->second.io_type == GPIO_IN) {
            // 如果为输入模式，读取实际电平值
            DataBit = gpio_get_level(static_cast<gpio_num_t>(pin));
        }
    }

    it->second.status = DataBit;  // 更新GPIO_Registry中该引脚的状态
    return DataBit;               // 返回读取的数据位
}

/**
 *@brief 读取一组GPIO状态
 *这个函数读取GPIO_Registry map中所有GPIO的状态，并返回一个map，DataGroup，用于存储所有GPIO的状态。
 *@return std::map<uint8_t, int32_t> DataGroup，用于存储所有GPIO的状态。
 * @note 调用 void setAnalogOutputMode(bool mode) 函数可设置返回的模拟量类型 mode 设为 ADC_OUT_RAW_VALUE(默认) 时返回模拟值[0, 4095], 设为 ADC_OUT_VOLTAGE
 * 时返回电压[0, 3300]mv;
 */
std::map<uint8_t, int32_t> GPIOs::gpioReadDataGroup() {
    std::map<uint8_t, int32_t> DataGroup;  // 定义一个map，DataGroup，用于存储所有GPIO的状态

    // 遍历GPIO_Registry map
    // 对于每一个GPIO，调用gpioReadDataBit函数读取该GPIO的状态
    // 将该GPIO的编号和读取到的状态插入DataGroup map中
    for (auto &i : GPIO_Registry) DataGroup.insert(std::pair<uint8_t, int32_t>(i.first, gpioReadDataBit(i.first)));

    return DataGroup;  // 返回DataGroup map
}

/**
 * @brief 读取一个GPIO引脚的配置
 * @param[in] pin GPIO引脚编号
 * @return 返回读取到的配置，如果GPIO引脚不存在，返回-1
 */
GPIOs::GPIO_Type GPIOs::gpioReadConfigBit(uint8_t pin) {
    auto it = GPIO_Registry.find(pin);                  // 使用auto关键字，查询map对象GPIO_Registry中是否存在pin
    if (it == GPIO_Registry.end()) return GPIO_Type();  // 未找到配置则返回默认的空配置

    return it->second;  // 返回读取的引脚配置
}

/**
 *@brief 读取一组GPIO的引脚配置
 *这个函数读取GPIO_Registry map中所有GPIO的工作模式，并返回一个map。
 *@return std::map<uint8_t, int32_t> ConfigGroup，用于存储所有GPIO的工作模式。
 *@note 调用 void setAnalogOutputMode(bool mode) 函数可设置返回的模拟量类型 mode 设为 ADC_OUT_RAW_VALUE(默认) 时返回模拟值, 设为 ADC_OUT_VOLTAGE
 * 时返回电压(mv);
 */
std::unordered_map<uint8_t, GPIOs::GPIO_Type> GPIOs::gpioReadConfigGroup() { return GPIO_Registry; }

/**
 * @brief 写入单个GPIO的电平值
 * @param pin - 要写入的GPIO引脚.
 * @param value - 要写入引脚的值，可以是0(LOW)或1(HIGH).
 * @note 如果要写入的GPIO引脚没有初始化, 则尝试自动初始化为推挽输出模式.
 * @return void
 */
void GPIOs::gpioWriteBit(uint8_t pin, uint8_t value) {
    // 在GPIO注册表中查找给定的pin是否存在
    auto it = GPIO_Registry.find(pin);

    // 如果未找到引脚，尝试自动初始化为推挽输出模式
    if (it == GPIO_Registry.end()) {
        gpioInit(pin, {GPIO_OUT, GPIO_PP});

        it = GPIO_Registry.find(pin);           // 初始化后重新查找引脚
        if (it == GPIO_Registry.end()) return;  // 如果初始化后仍未找到，返回
    }

    // 检查引脚的io_type是否为输出类型，如果不是则返回
    if (it->second.io_type != GPIO_OUT && it->second.io_type != GPIO_IN_OUT) return;

    // 写入引脚电平值
    gpio_set_level(static_cast<gpio_num_t>(pin), value);

    // 更新GPIO_Registry中该引脚的状态
    it->second.status = static_cast<int32_t>(value);
}

/**
 *@brief 向多个GPIO写入数据
 *@param value 一个unordered_map容器，用于存储GPIO的编号和要写入的数据
 *该函数遍历value容器中的每一个元素，
 *如果GPIO_Registry中存在该GPIO编号并且属于输出引脚，则设置GPIO状态。
 */
void GPIOs::gpioWriteGroup(std::unordered_map<uint8_t, uint8_t> value) {
    for (auto &i : value) gpioWriteBit(i.first, i.second);
}

/**
 * @brief 将指定输出引脚置为高电平
 * @param pin - 要写入的GPIO引脚.
 * @return void
 */
void GPIOs::gpioSetBit(uint8_t pin) { gpioWriteBit(pin, HIGH); }

/**
 * @brief 将指定输出引脚置为低电平
 * @param pin - 要写入的GPIO引脚.
 * @return void
 */
void GPIOs::gpioResetBit(uint8_t pin) { gpioWriteBit(pin, LOW); }

/**
 * @brief 将指定输出引脚电平反转
 * @param pin - 要反转的GPIO引脚.
 * @return void
 */
void GPIOs::gpioToggleBit(uint8_t pin) {
    // 在GPIO注册表中查找指定引脚的状态
    auto it = GPIO_Registry.find(pin);

    if (it != GPIO_Registry.end()) {
        // 如果引脚存在于注册表中，执行电平反转操作
        gpioWriteBit(pin, !it->second.status);
    } else {
        // 如果注册表中不存在引脚, 则将引脚初始化后设置为低电平;
        gpioWriteBit(pin, LOW);
    }
}

/**
 * @brief 反转一组输出GPIO的引脚电平
 * @return void
 */
void GPIOs::gpioToggleGroup() {
    for (auto &i : GPIO_Registry) gpioToggleBit(i.first);
}

/**
 * @brief 从一组GPIO中移除指定的引脚
 * @param pin - 要移除的GPIO引脚.
 * 如果元素不存在，则该函数不会执行任何操作.
 * @return void
 */
void GPIOs::gpioRemoveBit(uint8_t pin) { GPIO_Registry.erase(pin); }

/**
 * @brief 清空一组GPIO
 * 将Group中的所有GPIO移除.
 * @return void
 */
void GPIOs::gpioRemoveGroup() { GPIO_Registry.clear(); }

/**
 * @brief 解析GPIO配置参数。
 *
 * 该函数用于解析传入的GPIO配置参数列表，并设置相应的引脚三态标识、模式标识和输入输出类型标识。
 * 如果传入了多个相同类别的标识，则仅使用第一个有效的标识，并发出警告。
 *
 * @param configs 传入的GPIO配置参数列表，由多个uint8_t类型的标识组成。
 *                每个标识代表一种GPIO配置（如上拉电阻、推挽模式、输出类型等）。
 * @param[out] tri_state 解析后的引脚三态标识（浮空、上拉、下拉）。如果未设置有效标识，返回GPIO_NULL。
 * @param[out] mode 解析后的引脚模式标识（推挽、开漏、模拟、中断）。如果未设置有效标识，返回GPIO_NULL。
 * @param[out] io_type 解析后的输入输出类型标识（输入、输出、输入&输出）。如果未设置有效标识，返回GPIO_NULL。
 *
 * @warning 如果传入了多个同类别的标识（如多个三态标识或模式标识），函数将仅使用第一个有效标识，并发出相应的警告。
 *
 * @note 该函数会在所有标识都已设置时提前退出循环，以提高性能。
 * @return 解析成功返回:true; 解析出错返回:false;
 *
 * @example
 * @code
 * uint8_t tri_state, mode, io_type;
 * std::vector<uint8_t> configs = {GPIO_PU, GPIO_PP, GPIO_OUT};
 * parseGPIOConfig(configs, tri_state, mode, io_type);
 * // tri_state == GPIO_PU, mode == GPIO_PP, io_type == GPIO_OUT
 * @endcode
 */
bool GPIOs::parse_GPIO_config(const std::unordered_set<uint8_t> &configs, uint8_t &tri_state, uint8_t &mode, uint8_t &io_type) {
    // 初始化或重置所有配置为无效状态（GPIO_NULL表示未设置）
    auto resetConfig = [&]() {
        tri_state = GPIO_NULL;  // 引脚三态（浮空、上拉、下拉）
        mode = GPIO_NULL;       // 引脚模式（推挽、开漏、模拟、中断）
        io_type = GPIO_NULL;    // 输入输出类型（输入、输出、输入&输出）
    };
    resetConfig();

    // 定义一个lambda函数，用于设置配置参数，并在必要时发出警告
    auto setConfig = [](uint8_t &field, uint8_t config, const char *warningMessage) {
        if (field != GPIO_NULL) {
            WARN(WarningLevel::WARNING, warningMessage);  // 如果对应的field已经设置过，发出警告
        } else {
            field = config;  // 否则设置field为传入的config值
        }
    };

