RMSHE-MSH/GasSensorOS/lib/kernel/io_esp32_s3.cpp
    // 遍历配置列表，解析每个参数
    for (uint8_t config : configs) {
        // 检查是否为三态标识（浮空、上拉、下拉）
        if (config == GPIO_PU || config == GPIO_PD || config == GPIO_FLOAT) {
            setConfig(tri_state, config, "multiple tri-state identifiers.");  // 设置tri_state
        }
        // 检查是否为模式标识（推挽、开漏、模拟、中断）
        else if (config == GPIO_PP || config == GPIO_OD || config == GPIO_ANALOG || config == GPIO_INTR) {
            setConfig(mode, config, "multiple mode identifiers.");  // 设置mode
        }
        // 检查是否为IO类型标识（输入、输出、输入&输出）
        else if (config == GPIO_OUT || config == GPIO_IN || config == GPIO_IN_OUT) {
            setConfig(io_type, config, "multiple IO type identifiers.");  // 设置io_type
        }
        // 对于未匹配的模式，输出错误;
        else {
            WARN(WarningLevel::ERROR, "this IO config does not exist, config:%x", config);
            // 重置引脚配置为无效状态，防止错误的配置生效
            resetConfig();
            return false;
        }

        // 如果所有标识均已设置，提前退出循环以提高性能
        if (tri_state != GPIO_NULL && mode != GPIO_NULL && io_type != GPIO_NULL) break;
    }

    // 检查是否有未设置的标识，并发出相应警告
    if (tri_state == GPIO_NULL) WARN(WarningLevel::WARNING, "tri-state identifier not set.");
    if (mode == GPIO_NULL) WARN(WarningLevel::WARNING, "mode identifier not set.");
    if (io_type == GPIO_NULL) WARN(WarningLevel::WARNING, "iO type identifier not set.");

    return true;
}

/**
 * @brief 验证 GPIO 配置的有效性
 *
 * 该函数用于验证给定的 GPIO 配置组合（`tri_state`、`mode` 和 `io_type`）是否有效。
 * 如果该组合在无效配置集合 `invalid_GPIO_configs` 中，则函数会发出错误警告，并将所有配置重置为 `GPIO_NULL`。
 * 同时，如果在使用上拉或下拉电阻时，没有设置输入、输出或输入输出方式，则同样会重置配置并返回错误。
 *
 * @param tri_state 引脚的三态配置（浮空、上拉、下拉）
 * @param mode 引脚的模式配置（推挽、开漏、模拟、中断）
 * @param io_type 引脚的输入输出类型（输入、输出、输入&输出）
 * @return true 如果配置有效，返回 true
 * @return false 如果配置无效，返回 false 并重置配置
 */
bool GPIOs::validate_GPIO_config(uint8_t &tri_state, uint8_t &mode, uint8_t &io_type) {
    // 初始化或重置所有配置为无效状态（GPIO_NULL表示未设置）
    auto resetConfig = [&]() {
        tri_state = GPIO_NULL;  // 引脚三态（浮空、上拉、下拉）
        mode = GPIO_NULL;       // 引脚模式（推挽、开漏、模拟、中断）
        io_type = GPIO_NULL;    // 输入输出类型（输入、输出、输入&输出）
    };

    std::unordered_set<uint8_t> currentConfig = {tri_state, mode, io_type};  // 生成当前配置的集合
    currentConfig.erase(GPIO_NULL);                                          // 移除未设置的标识（GPIO_NULL）

    // 如果当前配置组合不为空且在禁止的组合列表中，发出错误警告并重置配置
    if (!currentConfig.empty() && invalid_GPIO_configs.find(currentConfig) != invalid_GPIO_configs.end()) {
        WARN(WarningLevel::ERROR, "this GPIO configuration combination is prohibited.");
        // 重置引脚配置为无效状态，防止不合理组合生效
        resetConfig();
        return false;
    }

    // 当使用上拉或下拉电阻时，必须确保引脚被配置为输入、输出或输入输出，否则这些配置将无效。
    if ((tri_state == GPIO_PU || tri_state == GPIO_PD) && io_type == GPIO_NULL) {
        WARN(WarningLevel::ERROR, "Pull-Up or Pull-Down resistors require IO type to be set.");
        // 重置引脚配置为无效状态，防止错误的配置生效
        resetConfig();
        return false;
    }

    // 如果没有发现无效的配置组合，则返回 true
    return true;
}

void GPIOs::set_GPIO_config(uint8_t &pin, uint8_t tri_state, uint8_t mode, uint8_t io_type) {
    // 创建并初始化GPIO配置结构体
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << pin),          // 指定要配置的GPIO引脚
        .mode = GPIO_MODE_DISABLE,              // 默认禁用输入输出模式
        .pull_up_en = GPIO_PULLUP_DISABLE,      // 默认禁用上拉电阻
        .pull_down_en = GPIO_PULLDOWN_DISABLE,  // 默认禁用下拉电阻
        .intr_type = GPIO_INTR_DISABLE          // 默认禁用中断
    };

    // 设置上拉或下拉电阻，基于三态标识
    if (tri_state == GPIO_PU) {
        // 启用上拉电阻
        io_conf.pull_up_en = GPIO_PULLUP_ENABLE;
    } else if (tri_state == GPIO_PD) {
        // 启用下拉电阻
        io_conf.pull_down_en = GPIO_PULLDOWN_ENABLE;
    } else if (tri_state == GPIO_FLOAT) {
        io_conf.pull_up_en = GPIO_PULLUP_DISABLE;      // 禁用上拉电阻
        io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;  // 禁用下拉电阻
    }

    // 设置 GPIO 模式，基于 mode 和 io_type
    if (mode == GPIO_PP) {
        if (io_type == GPIO_OUT) {
            io_conf.mode = GPIO_MODE_OUTPUT;  // 推挽输出
        } else if (io_type == GPIO_IN_OUT) {
            io_conf.mode = GPIO_MODE_INPUT_OUTPUT;  // 输入和推挽输出
        }
    } else if (mode == GPIO_OD) {
        if (io_type == GPIO_OUT) {
            io_conf.mode = GPIO_MODE_OUTPUT_OD;  // 开漏输出
        } else if (io_type == GPIO_IN_OUT) {
            io_conf.mode = GPIO_MODE_INPUT_OUTPUT_OD;  // 输入和开漏输出
        }
    } else if (mode == GPIO_NULL && io_type == GPIO_IN) {
        io_conf.mode = GPIO_MODE_INPUT;  // 仅输入
    } else if (mode == GPIO_INTR) {
        io_conf.intr_type = GPIO_INTR_POSEDGE;  // 设置为上升沿触发中断
        io_conf.mode = GPIO_MODE_INPUT;         // 中断模式通常配置为输入
    }
    // 模拟模式（GPIO_ANALOG）通常不直接配置 GPIO 引脚，而是配置相关外设，因此在此未处理

    // 应用配置到指定的GPIO引脚
    gpio_config(&io_conf);

    // 储存 GPIO 引脚对应的工作模式（状态未知时存储为 -1）
    // GPIO_Registry[pin] = GPIO_Type{-1, mode};
    GPIO_Registry.insert(std::pair<uint8_t, GPIO_Type>(pin, GPIO_Type{-1, tri_state, mode, io_type}));
}

/*------------------------------------ LEDCPWM ------------------------------------*/
struct LedcTimerHash {
    std::size_t operator()(const ledc_timer_t &timer) const { return std::hash<int>()(timer); }
};
struct LedcChannelHash {
    std::size_t operator()(const ledc_channel_t &channel) const { return std::hash<int>()(channel); }
};

// unordered_set 容器在创建时使用了 LedcTimerHash 和 LedcChannelHash 两个结构体，作为容器中元素的哈希函数，以维护容器中元素的哈希值;
std::unordered_set<ledc_timer_t, LedcTimerHash> timer = {LEDC_TIMER_0, LEDC_TIMER_1, LEDC_TIMER_2, LEDC_TIMER_3};
std::unordered_set<ledc_channel_t, LedcChannelHash> channel = {LEDC_CHANNEL_0, LEDC_CHANNEL_1, LEDC_CHANNEL_2, LEDC_CHANNEL_3,
                                                               LEDC_CHANNEL_4, LEDC_CHANNEL_5, LEDC_CHANNEL_6, LEDC_CHANNEL_7};

void LEDCPWM::pwmConfig(uint8_t pin, ledc_timer_bit_t duty_resolution, uint32_t freq_hz, ledc_mode_t speed_mode, uint32_t duty) {
    _pin = pin;
    _duty_resolution = duty_resolution;
    _freq_hz = freq_hz;
    _speed_mode = speed_mode;
    _duty = duty;
}

/**
 * @brief 使能LEDCPWM控制器
 * @note 将自动分配并链接定时器和通道, 启动LEDCPWM控制器
 * @return void
 */
void LEDCPWM::pwmEnable() {
    /*
    1.如果指定的PWM输出引脚pin不存在，则返回.
    2.如果 timer 集合为空，则返回.
    3.如果指定的PWM输出引脚pin不支持硬件PWM,则返回.
    */
    auto gpio = esp32_s3_wroom_1_gpios.find(_pin);
    if (gpio == esp32_s3_wroom_1_gpios.end() || timer.empty() || (gpio->second).find(PWM) == (gpio->second).end()) return;

