RMSHE-MSH/GasSensorOS/lib/kernel/io_esp32_s3.cpp
    /*
    分别从两个无序集合里抽取定时器和通道并将其组合链接到一起,
    这两个集合中的元素被抽出表示定时器或通道正在被使用,
    当调用pwmDisable时, 才会把它们放回集合.
    */
    // 将一个定时器从unordered_set timer中抽出(unordered_set是无序的因此我们不知道抽出的具体是哪一个定时器)
    ledc_timer_t SelectedTimer = *timer.begin();
    timer.erase(SelectedTimer);

    // 将一个通道从unordered_set channel中抽出(unordered_set是无序的因此我们不知道抽出的具体是哪一个通道)
    ledc_channel_t SelectedChannel = *channel.begin();
    channel.erase(SelectedChannel);

    // 配置 LEDC 定时器
    ledc_timer.duty_resolution = _duty_resolution;  // 设置占空比解析度
    ledc_timer.freq_hz = _freq_hz;                  // 设置PWM频率
    ledc_timer.speed_mode = _speed_mode;            // 设置时钟速度模式
    ledc_timer.timer_num = SelectedTimer;           // 指定定时器
    ledc_timer_config(&ledc_timer);

    // 配置 LEDC 通道
    ledc_channel.channel = SelectedChannel;  // 指定通道
    ledc_channel.duty = _duty;               // 设置初始占空比
    ledc_channel.gpio_num = _pin;            // 设置PWM输出引脚
    ledc_channel.speed_mode = _speed_mode;   // 设置时钟速度模式
    ledc_channel.timer_sel = SelectedTimer;  // 指定定时器
    ledc_channel_config(&ledc_channel);

    /*
    更改占空比的函数如下:
    esp_err_t ledc_set_duty(ledc_mode_t speed_mode, ledc_channel_t channel, uint32_t duty)

    ledc_set_duty函数中duty_cycle的最大值(即占空比100%时)取决于占空比解析度（duty_resolution）的设置;
    根据占空比解析度的设置，duty_cycle的最大值可以使用此公式计算: duty_cycle_max = (1 << duty_resolution) - 1;.

    这个位置将[DUTY_CYCLE_MIN = 0, DUTY_CYCLE_MAX = 10 000 000]区间映射到[0, duty_cycle_max = 100%占空比]区间, 公式如下:
    (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min

    float TIMER_BIT_DUTY_CYCLE = ((1 << ledc_timer.duty_resolution) - 1) / static_cast<float>(DUTY_CYCLE_MAX);
    uint32_t duty_cycle = static_cast<uint32_t>(TIMER_BIT_DUTY_CYCLE * dutyCycle));
    */
    TIMER_BIT_DUTY_CYCLE = ((1 << ledc_timer.duty_resolution) - 1) / static_cast<float>(DUTY_CYCLE_MAX);
}

/**
 * @brief 禁用LEDCPWM控制器, 停止PWM输出.
 * @return void
 */
void LEDCPWM::pwmDisable() {
    ledc_stop(ledc_timer.speed_mode, ledc_channel.channel, 0);  // 停止PWM波形的输出
    timer.insert(ledc_timer.timer_num);                         // 释放定时器(将空闲的定时器放回timer, 以供其他PWM实例调用)
    channel.insert(ledc_channel.channel);                       // 释放通道(将空闲的通道放回channel, 以供其他PWM实例调用)
}

/**
 * @brief 调整PWM的占空比
 * @param dutyCycle 占空比, 取值范围为: [DUTY_CYCLE_MIN = 0, DUTY_CYCLE_MAX = 10 000 000].
 * @note dutyCycle = 0 时占空比为 0%, dutyCycle = 10 000 000 时占空比为 100%.
 * @note 为什么将DUTY_CYCLE_MAX定为10000000 :
 * 1.这个数值保证了硬件PWM所能达到的最高解析度, 在做区间映射时不会造成失真;
 * 2.这个数值避免了大量的浮点计算;
 * 3.这个数值使用起来相对方便;
 * @return void
 */
void LEDCPWM::updateDuty(uint32_t duty) {
    ledc_set_duty(ledc_timer.speed_mode, ledc_channel.channel, static_cast<uint32_t>(TIMER_BIT_DUTY_CYCLE * duty));
    ledc_update_duty(ledc_timer.speed_mode, ledc_channel.channel);
}

/**
 * @brief 在给定时间内将当前占空比线性变换到目标占空比.
 * @param duration_ms 持续时间 ms
 * @param target_duty 目标占空比
 * @param fade_mode 渐变模式, 设为"LEDC_FADE_NO_WAIT(默认)"时渐变函数将立即返回，不阻塞后续代码的执行;
 * 设为"LEDC_FADE_WAIT_DONE"时渐变函数将阻塞，直到渐变到目标占空比为止.
 * @note 占空比范围: [DUTY_CYCLE_MIN = 0, DUTY_CYCLE_MAX = 10 000 000]
 * @return void
 */
void LEDCPWM::fadeWithTime(uint64_t duration_ms, uint32_t target_duty, ledc_fade_mode_t fade_mode) {
    /*
    软件实现:
    // 持续时间不能为零, 起始占空比不能与中止占空比相同;
    if (duration_ms == 0 || beginDutyCycle == endDutyCycle) return;

    // 计算周期间隔
    int32_t interval = static_cast<int32_t>(endDutyCycle - beginDutyCycle) / static_cast<int32_t>(duration_ms);

    // 控制循环方向
    int8_t step = interval > 0 ? 1 : -1;

    // 循环间隔乘以 step 将变为正值
    interval = abs(interval) * step;

    // 更新占空比(检查循环变量 i 是否符合循环终止条件。如果 step 大于 0，则当 i 小于endDutyCycle 时继续循环；否则，当 i 大于 endDutyCycle 时继续循环。)
    for (int32_t i = beginDutyCycle; step > 0 ? i < endDutyCycle : i > endDutyCycle; i += interval) {
        updateDuty(i);
        vTaskDelay(1 / portTICK_PERIOD_MS);
    }
    */

    // 硬件实现:
    ledc_fade_func_install(0);  // 使能渐变
    ledc_set_fade_with_time(ledc_timer.speed_mode, ledc_channel.channel, static_cast<uint32_t>(TIMER_BIT_DUTY_CYCLE * target_duty), duration_ms);
    ledc_fade_start(ledc_timer.speed_mode, ledc_channel.channel, fade_mode);
}

/**
 * @brief 在给定时间内将当前占空比线性变换到目标占空比.
 * @param scale 占空比步长
 * @param cycle_num 总步数
 * @param target_duty 目标占空比
 * @param fade_mode 渐变模式, 设为"LEDC_FADE_NO_WAIT(默认)"时渐变函数将立即返回，不阻塞后续代码的执行;
 * 设为"LEDC_FADE_WAIT_DONE"时渐变函数将阻塞，直到渐变到目标占空比为止.
 * @note 占空比范围: [DUTY_CYCLE_MIN = 0, DUTY_CYCLE_MAX = 10 000 000]
 * @return void
 */
void LEDCPWM::fadeWithStep(uint32_t scale, uint32_t cycle_num, uint32_t target_duty, ledc_fade_mode_t fade_mode) {
    // 硬件实现:
    ledc_fade_func_install(0);  // 使能渐变
    ledc_set_fade_with_step(ledc_timer.speed_mode, ledc_channel.channel, static_cast<uint32_t>(TIMER_BIT_DUTY_CYCLE * target_duty), scale, cycle_num);
    ledc_fade_start(ledc_timer.speed_mode, ledc_channel.channel, fade_mode);
}